# Pandas_Practice

In [1]:
import numpy as np
import pandas as pd

In [6]:
dictionery = {
    'Name' : ['Horair', 'Waqas','Waheed','Mabtoor', 'Hasnat','Fahad','Saleem'],
    'Rollno' : [2331,6453,6346,7425,4425,6443,7535],
    'AgNO' : [8206,8224,8241,8208,8205,8190,8232],
    'Remarks' : ['Good', 'To Good','Excellent','Not_Bad', 'Amazing','Powerfull', 'Splendid']
}

In [7]:
dictionery

{'Name': ['Horair', 'Waqas', 'Waheed', 'Mabtoor', 'Hasnat', 'Fahad', 'Saleem'],
 'Rollno': [2331, 6453, 6346, 7425, 4425, 6443, 7535],
 'AgNO': [8206, 8224, 8241, 8208, 8205, 8190, 8232],
 'Remarks': ['Good',
  'To Good',
  'Excellent',
  'Not_Bad',
  'Amazing',
  'Powerfull',
  'Splendid']}

In [8]:
df = pd.DataFrame(dictionery)

In [9]:
df

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [10]:
df.head()

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing

In [11]:
df.head(2)

     Name  Rollno  AgNO  Remarks
0  Horair    2331  8206     Good
1   Waqas    6453  8224  To Good

In [12]:
df.tail(2)

     Name  Rollno  AgNO    Remarks
5   Fahad    6443  8190  Powerfull
6  Saleem    7535  8232   Splendid

In [13]:
df.to_csv('Info.csv')

In [17]:
pd.read_csv('info.csv')

   Unnamed: 0     Name  Rollno  AgNO    Remarks
0           0   Horair    2331  8206       Good
1           1    Waqas    6453  8224    To Good
2           2   Waheed    6346  8241  Excellent
3           3  Mabtoor    7425  8208    Not_Bad
4           4   Hasnat    4425  8205    Amazing
5           5    Fahad    6443  8190  Powerfull
6           6   Saleem    7535  8232   Splendid

In [18]:
df

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [19]:
df.to_csv('info_Without_Indices', index=False)

In [23]:
pd.read_csv('info_Without_Indices')

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [25]:
df.to_excel('info.xlsx')

In [26]:
pd.read_excel('info.xlsx')

   Unnamed: 0     Name  Rollno  AgNO    Remarks
0           0   Horair    2331  8206       Good
1           1    Waqas    6453  8224    To Good
2           2   Waheed    6346  8241  Excellent
3           3  Mabtoor    7425  8208    Not_Bad
4           4   Hasnat    4425  8205    Amazing
5           5    Fahad    6443  8190  Powerfull
6           6   Saleem    7535  8232   Splendid

In [27]:
df.to_excel('info_without_indices.xlsx', index=False)

In [28]:
pd.read_excel('info_without_indices.xlsx')

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [29]:
df.to_csv('info.txt')

In [31]:
pd.read_csv('info.txt')

   Unnamed: 0     Name  Rollno  AgNO    Remarks
0           0   Horair    2331  8206       Good
1           1    Waqas    6453  8224    To Good
2           2   Waheed    6346  8241  Excellent
3           3  Mabtoor    7425  8208    Not_Bad
4           4   Hasnat    4425  8205    Amazing
5           5    Fahad    6443  8190  Powerfull
6           6   Saleem    7535  8232   Splendid

In [32]:
df.to_csv('info_without_indices.txt' , index=False)

In [33]:
pd.read_csv('info_without_indices')

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [34]:
df

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [35]:
df.head(2)

     Name  Rollno  AgNO  Remarks
0  Horair    2331  8206     Good
1   Waqas    6453  8224  To Good

In [36]:
df.tail(2)

     Name  Rollno  AgNO    Remarks
5   Fahad    6443  8190  Powerfull
6  Saleem    7535  8232   Splendid

In [37]:
df.describe()

            Rollno         AgNO
count     7.000000     7.000000
mean   5851.142857  8215.142857
std    1857.197748    17.799144
min    2331.000000  8190.000000
25%    5385.500000  8205.500000
50%    6443.000000  8208.000000
75%    6939.000000  8228.000000
max    7535.000000  8241.000000

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     7 non-null      object
 1   Rollno   7 non-null      int64
 2   AgNO     7 non-null      int64
 3   Remarks  7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [39]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [40]:
df.columns

Index(['Name', 'Rollno', 'AgNO', 'Remarks'], dtype='object')

In [46]:
df['Name']

0     Horair
1      Waqas
2     Waheed
3    Mabtoor
4     Hasnat
5      Fahad
6     Saleem
Name: Name, dtype: object

In [48]:
df['Name'][0] = 'Hurair'

<ipython-input-48-f0834ae8b0ff>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Hurair'

In [49]:
df

      Name  Rollno  AgNO    Remarks
0   Hurair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [50]:
df['Name'][0] = 'Horair'

<ipython-input-50-582c56dde128>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Horair'

In [51]:
df

      Name  Rollno  AgNO    Remarks
0   Horair    2331  8206       Good
1    Waqas    6453  8224    To Good
2   Waheed    6346  8241  Excellent
3  Mabtoor    7425  8208    Not_Bad
4   Hasnat    4425  8205    Amazing
5    Fahad    6443  8190  Powerfull
6   Saleem    7535  8232   Splendid

In [52]:
ser = pd.Series(np.random.randint(3,4))

In [53]:
ser

0    3
dtype: int64

In [54]:
type(ser)

pandas.core.series.Series

In [55]:
newdf = pd.DataFrame(np.random.rand(333,5), index=np.arange(333))

In [56]:
newdf

            0         1         2         3         4
0    0.934834  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [57]:
newdf.head(2)

          0         1         2         3         4
0  0.934834  0.332092  0.284518  0.961658  0.218855
1  0.885165  0.937815  0.609975  0.966259  0.165130

In [58]:
newdf.tail(2)

            0         1         2         3         4
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

In [59]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 333 entries, 0 to 332
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       333 non-null    float64
 1   1       333 non-null    float64
 2   2       333 non-null    float64
 3   3       333 non-null    float64
 4   4       333 non-null    float64
dtypes: float64(5)
memory usage: 15.6 KB

In [61]:
newdf.shape

(333, 5)

In [66]:
newdf.describe()

                0           1           2           3           4
count  333.000000  333.000000  333.000000  333.000000  333.000000
mean     0.497029    0.501879    0.478515    0.494548    0.496528
std      0.294886    0.302499    0.289845    0.299001    0.282791
min      0.000737    0.000572    0.006118    0.003848    0.004973
25%      0.239399    0.261980    0.217403    0.223891    0.255046
50%      0.498155    0.487858    0.486081    0.496844    0.499451
75%      0.747748    0.785806    0.741815    0.764500    0.732363
max      0.998650    0.999299    0.998759    0.991943    0.991935

In [67]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,323,324,325,326,327,328,329,330,331,332
0,0.934834,0.885165,0.950992,0.313766,0.006151,0.885904,0.587947,0.092529,0.916531,0.189173,...,0.745800,0.724635,0.584801,0.882044,0.028609,0.646909,0.835658,0.793482,0.721614,0.191087
1,0.332092,0.937815,0.021788,0.844269,0.015754,0.027442,0.010328,0.128455,0.016833,0.733311,...,0.999299,0.813458,0.863043,0.016861,0.728070,0.158164,0.338965,0.854421,0.815285,0.313832
2,0.284518,0.609975,0.547581,0.420616,0.580372,0.788515,0.750219,0.286313,0.124980,0.916122,...,0.796991,0.222510,0.594840,0.051696,0.622207,0.668872,0.528171,0.401387,0.309204,0.239182
3,0.961658,0.966259,0.123348,0.346719,0.983157,0.257756,0.656436,0.567360,0.185652,0.909745,...,0.893229,0.680643,0.892942,0.864301,0.753009,0.186677,0.681764,0.223891,0.325392,0.496289
4,0.218855,0.165130,0.436368,0.409284,0.215943,0.041344,0.589788,0.853250,0.071278,0.256047,...,0.916100,0.947817,0.918498,0.923121,0.859532,0.285940,0.317723,0.093652,0.248130,0.576086

In [68]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            323, 324, 325, 326, 327, 328, 329, 330, 331, 332],
           dtype='int64', length=333)

In [69]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [71]:
newdf[0][0]

0.9348341687577305

In [72]:
newdf.to_numpy()

array([[0.93483417, 0.33209189, 0.28451814, 0.96165833, 0.21885458],
       [0.88516503, 0.93781533, 0.60997527, 0.96625883, 0.16513044],
       [0.95099235, 0.02178841, 0.547581  , 0.12334751, 0.4363684 ],
       ...,
       [0.79348245, 0.85442057, 0.40138703, 0.22389108, 0.09365174],
       [0.72161425, 0.81528512, 0.3092037 , 0.32539172, 0.24813014],
       [0.19108653, 0.31383194, 0.23918156, 0.49628933, 0.57608575]])

In [73]:
newdf.head(2)

          0         1         2         3         4
0  0.934834  0.332092  0.284518  0.961658  0.218855
1  0.885165  0.937815  0.609975  0.966259  0.165130

In [74]:
newdf.tail(2)

            0         1         2         3         4
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

In [75]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [78]:
newdf.shape

(333, 5)

In [79]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
332  0.191087  0.313832  0.239182  0.496289  0.576086
331  0.721614  0.815285  0.309204  0.325392  0.248130
330  0.793482  0.854421  0.401387  0.223891  0.093652
329  0.835658  0.338965  0.528171  0.681764  0.317723
328  0.646909  0.158164  0.668872  0.186677  0.285940
..        ...       ...       ...       ...       ...
4    0.006151  0.015754  0.580372  0.983157  0.215943
3    0.313766  0.844269  0.420616  0.346719  0.409284
2    0.950992  0.021788  0.547581  0.123348  0.436368
1    0.885165  0.937815  0.609975  0.966259  0.165130
0    0.934834  0.332092  0.284518  0.961658  0.218855

[333 rows x 5 columns]

In [80]:
newdf.sort_index(axis=1, ascending=True)

            0         1         2         3         4
0    0.934834  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [81]:
newdf2 = newdf

In [82]:
newdf2

            0         1         2         3         4
0    0.934834  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [84]:
newdf2[0][0]  = 3134243

In [85]:
newdf2

                0         1         2         3         4
0    3.134243e+06  0.332092  0.284518  0.961658  0.218855
1    8.851650e-01  0.937815  0.609975  0.966259  0.165130
2    9.509924e-01  0.021788  0.547581  0.123348  0.436368
3    3.137660e-01  0.844269  0.420616  0.346719  0.409284
4    6.151195e-03  0.015754  0.580372  0.983157  0.215943
..            ...       ...       ...       ...       ...
328  6.469089e-01  0.158164  0.668872  0.186677  0.285940
329  8.356582e-01  0.338965  0.528171  0.681764  0.317723
330  7.934824e-01  0.854421  0.401387  0.223891  0.093652
331  7.216142e-01  0.815285  0.309204  0.325392  0.248130
332  1.910865e-01  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [86]:
newdf

                0         1         2         3         4
0    3.134243e+06  0.332092  0.284518  0.961658  0.218855
1    8.851650e-01  0.937815  0.609975  0.966259  0.165130
2    9.509924e-01  0.021788  0.547581  0.123348  0.436368
3    3.137660e-01  0.844269  0.420616  0.346719  0.409284
4    6.151195e-03  0.015754  0.580372  0.983157  0.215943
..            ...       ...       ...       ...       ...
328  6.469089e-01  0.158164  0.668872  0.186677  0.285940
329  8.356582e-01  0.338965  0.528171  0.681764  0.317723
330  7.934824e-01  0.854421  0.401387  0.223891  0.093652
331  7.216142e-01  0.815285  0.309204  0.325392  0.248130
332  1.910865e-01  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [88]:
newdf2.copy()

                0         1         2         3         4
0    3.134243e+06  0.332092  0.284518  0.961658  0.218855
1    8.851650e-01  0.937815  0.609975  0.966259  0.165130
2    9.509924e-01  0.021788  0.547581  0.123348  0.436368
3    3.137660e-01  0.844269  0.420616  0.346719  0.409284
4    6.151195e-03  0.015754  0.580372  0.983157  0.215943
..            ...       ...       ...       ...       ...
328  6.469089e-01  0.158164  0.668872  0.186677  0.285940
329  8.356582e-01  0.338965  0.528171  0.681764  0.317723
330  7.934824e-01  0.854421  0.401387  0.223891  0.093652
331  7.216142e-01  0.815285  0.309204  0.325392  0.248130
332  1.910865e-01  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [89]:
newdf

                0         1         2         3         4
0    3.134243e+06  0.332092  0.284518  0.961658  0.218855
1    8.851650e-01  0.937815  0.609975  0.966259  0.165130
2    9.509924e-01  0.021788  0.547581  0.123348  0.436368
3    3.137660e-01  0.844269  0.420616  0.346719  0.409284
4    6.151195e-03  0.015754  0.580372  0.983157  0.215943
..            ...       ...       ...       ...       ...
328  6.469089e-01  0.158164  0.668872  0.186677  0.285940
329  8.356582e-01  0.338965  0.528171  0.681764  0.317723
330  7.934824e-01  0.854421  0.401387  0.223891  0.093652
331  7.216142e-01  0.815285  0.309204  0.325392  0.248130
332  1.910865e-01  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [92]:
newdf.loc[0][0]= 0.34243412

In [93]:
newdf

            0         1         2         3         4
0    0.342434  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [94]:
type(newdf)

pandas.core.frame.DataFrame

In [95]:
type(newdf[0])

pandas.core.series.Series

In [96]:
newdf.head(2)

          0         1         2         3         4
0  0.342434  0.332092  0.284518  0.961658  0.218855
1  0.885165  0.937815  0.609975  0.966259  0.165130

In [97]:
newdf.drop(0, axis=1)

            1         2         3         4
0    0.332092  0.284518  0.961658  0.218855
1    0.937815  0.609975  0.966259  0.165130
2    0.021788  0.547581  0.123348  0.436368
3    0.844269  0.420616  0.346719  0.409284
4    0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...
328  0.158164  0.668872  0.186677  0.285940
329  0.338965  0.528171  0.681764  0.317723
330  0.854421  0.401387  0.223891  0.093652
331  0.815285  0.309204  0.325392  0.248130
332  0.313832  0.239182  0.496289  0.576086

[333 rows x 4 columns]

In [98]:
newdf.head(1)

          0         1         2         3         4
0  0.342434  0.332092  0.284518  0.961658  0.218855

In [99]:
newdf.drop(0, axis=0)

            0         1         2         3         4
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
5    0.885904  0.027442  0.788515  0.257756  0.041344
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[332 rows x 5 columns]

In [100]:
newdf.drop(4, axis=0)

            0         1         2         3         4
0    0.342434  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
5    0.885904  0.027442  0.788515  0.257756  0.041344
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[332 rows x 5 columns]

In [101]:
newdf.reset_index()

     index         0         1         2         3         4
0        0  0.342434  0.332092  0.284518  0.961658  0.218855
1        1  0.885165  0.937815  0.609975  0.966259  0.165130
2        2  0.950992  0.021788  0.547581  0.123348  0.436368
3        3  0.313766  0.844269  0.420616  0.346719  0.409284
4        4  0.006151  0.015754  0.580372  0.983157  0.215943
..     ...       ...       ...       ...       ...       ...
328    328  0.646909  0.158164  0.668872  0.186677  0.285940
329    329  0.835658  0.338965  0.528171  0.681764  0.317723
330    330  0.793482  0.854421  0.401387  0.223891  0.093652
331    331  0.721614  0.815285  0.309204  0.325392  0.248130
332    332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 6 columns]

In [102]:
newdf.iloc[0,3]

0.9616583286189111

In [103]:
newdf.head(2)

          0         1         2         3         4
0  0.342434  0.332092  0.284518  0.961658  0.218855
1  0.885165  0.937815  0.609975  0.966259  0.165130

In [104]:
newdf.iloc[0, 2]

0.2845181373272082

In [105]:
newdf.isnull()

         0      1      2      3      4
0    False  False  False  False  False
1    False  False  False  False  False
2    False  False  False  False  False
3    False  False  False  False  False
4    False  False  False  False  False
..     ...    ...    ...    ...    ...
328  False  False  False  False  False
329  False  False  False  False  False
330  False  False  False  False  False
331  False  False  False  False  False
332  False  False  False  False  False

[333 rows x 5 columns]

In [106]:
newdf.dropna()

            0         1         2         3         4
0    0.342434  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [107]:
newdf.head(2)

          0         1         2         3         4
0  0.342434  0.332092  0.284518  0.961658  0.218855
1  0.885165  0.937815  0.609975  0.966259  0.165130

In [110]:
newdf.drop_duplicates(subset =0)

            0         1         2         3         4
0    0.342434  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [111]:
newdf.head(2)

          0         1         2         3         4
0  0.342434  0.332092  0.284518  0.961658  0.218855
1  0.885165  0.937815  0.609975  0.966259  0.165130

In [112]:
newdf.reset_index()

     index         0         1         2         3         4
0        0  0.342434  0.332092  0.284518  0.961658  0.218855
1        1  0.885165  0.937815  0.609975  0.966259  0.165130
2        2  0.950992  0.021788  0.547581  0.123348  0.436368
3        3  0.313766  0.844269  0.420616  0.346719  0.409284
4        4  0.006151  0.015754  0.580372  0.983157  0.215943
..     ...       ...       ...       ...       ...       ...
328    328  0.646909  0.158164  0.668872  0.186677  0.285940
329    329  0.835658  0.338965  0.528171  0.681764  0.317723
330    330  0.793482  0.854421  0.401387  0.223891  0.093652
331    331  0.721614  0.815285  0.309204  0.325392  0.248130
332    332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 6 columns]

In [113]:
newdf.drop(0, axis=1)

            1         2         3         4
0    0.332092  0.284518  0.961658  0.218855
1    0.937815  0.609975  0.966259  0.165130
2    0.021788  0.547581  0.123348  0.436368
3    0.844269  0.420616  0.346719  0.409284
4    0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...
328  0.158164  0.668872  0.186677  0.285940
329  0.338965  0.528171  0.681764  0.317723
330  0.854421  0.401387  0.223891  0.093652
331  0.815285  0.309204  0.325392  0.248130
332  0.313832  0.239182  0.496289  0.576086

[333 rows x 4 columns]

In [114]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 333 entries, 0 to 332
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       333 non-null    float64
 1   1       333 non-null    float64
 2   2       333 non-null    float64
 3   3       333 non-null    float64
 4   4       333 non-null    float64
dtypes: float64(5)
memory usage: 23.7 KB

In [115]:
newdf.sum()

0    164.918265
1    167.125759
2    159.345575
3    164.684438
4    165.343881
dtype: float64

In [116]:
newdf.max()

0    0.998650
1    0.999299
2    0.998759
3    0.991943
4    0.991935
dtype: float64

In [117]:
newdf.mean()

0    0.495250
1    0.501879
2    0.478515
3    0.494548
4    0.496528
dtype: float64

In [118]:
newdf.max()

0    0.998650
1    0.999299
2    0.998759
3    0.991943
4    0.991935
dtype: float64

In [120]:
newdf.add(19)

             0          1          2          3          4
0    19.342434  19.332092  19.284518  19.961658  19.218855
1    19.885165  19.937815  19.609975  19.966259  19.165130
2    19.950992  19.021788  19.547581  19.123348  19.436368
3    19.313766  19.844269  19.420616  19.346719  19.409284
4    19.006151  19.015754  19.580372  19.983157  19.215943
..         ...        ...        ...        ...        ...
328  19.646909  19.158164  19.668872  19.186677  19.285940
329  19.835658  19.338965  19.528171  19.681764  19.317723
330  19.793482  19.854421  19.401387  19.223891  19.093652
331  19.721614  19.815285  19.309204  19.325392  19.248130
332  19.191087  19.313832  19.239182  19.496289  19.576086

[333 rows x 5 columns]

In [121]:
newdf.subtract(19)

             0          1          2          3          4
0   -18.657566 -18.667908 -18.715482 -18.038342 -18.781145
1   -18.114835 -18.062185 -18.390025 -18.033741 -18.834870
2   -18.049008 -18.978212 -18.452419 -18.876652 -18.563632
3   -18.686234 -18.155731 -18.579384 -18.653281 -18.590716
4   -18.993849 -18.984246 -18.419628 -18.016843 -18.784057
..         ...        ...        ...        ...        ...
328 -18.353091 -18.841836 -18.331128 -18.813323 -18.714060
329 -18.164342 -18.661035 -18.471829 -18.318236 -18.682277
330 -18.206518 -18.145579 -18.598613 -18.776109 -18.906348
331 -18.278386 -18.184715 -18.690796 -18.674608 -18.751870
332 -18.808913 -18.686168 -18.760818 -18.503711 -18.423914

[333 rows x 5 columns]

In [122]:
newdf

            0         1         2         3         4
0    0.342434  0.332092  0.284518  0.961658  0.218855
1    0.885165  0.937815  0.609975  0.966259  0.165130
2    0.950992  0.021788  0.547581  0.123348  0.436368
3    0.313766  0.844269  0.420616  0.346719  0.409284
4    0.006151  0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...       ...
328  0.646909  0.158164  0.668872  0.186677  0.285940
329  0.835658  0.338965  0.528171  0.681764  0.317723
330  0.793482  0.854421  0.401387  0.223891  0.093652
331  0.721614  0.815285  0.309204  0.325392  0.248130
332  0.191087  0.313832  0.239182  0.496289  0.576086

[333 rows x 5 columns]

In [123]:
newdf.drop(0, axis=1, inplace=True)

In [124]:
newdf

            1         2         3         4
0    0.332092  0.284518  0.961658  0.218855
1    0.937815  0.609975  0.966259  0.165130
2    0.021788  0.547581  0.123348  0.436368
3    0.844269  0.420616  0.346719  0.409284
4    0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...
328  0.158164  0.668872  0.186677  0.285940
329  0.338965  0.528171  0.681764  0.317723
330  0.854421  0.401387  0.223891  0.093652
331  0.815285  0.309204  0.325392  0.248130
332  0.313832  0.239182  0.496289  0.576086

[333 rows x 4 columns]

In [126]:
newdf.notnull()

        1     2     3     4
0    True  True  True  True
1    True  True  True  True
2    True  True  True  True
3    True  True  True  True
4    True  True  True  True
..    ...   ...   ...   ...
328  True  True  True  True
329  True  True  True  True
330  True  True  True  True
331  True  True  True  True
332  True  True  True  True

[333 rows x 4 columns]

In [127]:
newdf.std()

1    0.302499
2    0.289845
3    0.299001
4    0.282791
dtype: float64

In [128]:
newdf.count()

1    333
2    333
3    333
4    333
dtype: int64

In [129]:
newdf.median()

1    0.487858
2    0.486081
3    0.496844
4    0.499451
dtype: float64

In [130]:
newdf.corr()

          1         2         3         4
1  1.000000  0.057939 -0.076725 -0.012890
2  0.057939  1.000000  0.063462 -0.007591
3 -0.076725  0.063462  1.000000  0.012278
4 -0.012890 -0.007591  0.012278  1.000000

In [132]:
for df in pd.read_csv('info.csv', chunksize=2):
    print("ChunkSize")
    print(df)

ChunkSize
   Unnamed: 0    Name  Rollno  AgNO  Remarks
0           0  Horair    2331  8206     Good
1           1   Waqas    6453  8224  To Good
ChunkSize
   Unnamed: 0     Name  Rollno  AgNO    Remarks
2           2   Waheed    6346  8241  Excellent
3           3  Mabtoor    7425  8208    Not_Bad
ChunkSize
   Unnamed: 0    Name  Rollno  AgNO    Remarks
4           4  Hasnat    4425  8205    Amazing
5           5   Fahad    6443  8190  Powerfull
ChunkSize
   Unnamed: 0    Name  Rollno  AgNO   Remarks
6           6  Saleem    7535  8232  Splendid

In [133]:
df.head()

   Unnamed: 0    Name  Rollno  AgNO   Remarks
6           6  Saleem    7535  8232  Splendid

In [134]:
newdf

            1         2         3         4
0    0.332092  0.284518  0.961658  0.218855
1    0.937815  0.609975  0.966259  0.165130
2    0.021788  0.547581  0.123348  0.436368
3    0.844269  0.420616  0.346719  0.409284
4    0.015754  0.580372  0.983157  0.215943
..        ...       ...       ...       ...
328  0.158164  0.668872  0.186677  0.285940
329  0.338965  0.528171  0.681764  0.317723
330  0.854421  0.401387  0.223891  0.093652
331  0.815285  0.309204  0.325392  0.248130
332  0.313832  0.239182  0.496289  0.576086

[333 rows x 4 columns]

In [ ]:
d